# ------- Задача «Площадь прямоугольного треугольника» -------- #
#                                                               #
# Условие                                                       #
# Напишите программу, которая считывает длины двух катетов      #
# в прямоугольном треугольнике и выводит его площадь.           #
# Каждое число записано в отдельной строке.                     #
# ------------------------------------------------------------- #

print(int(input())*int(input())/2)
