# Напишите программу, которая выводит "Hello, BeeGeek!" (без кавычек)            |
# 19 раз, каждый на своей строке                                                 |
# -------------------------------------------------------------------------------|

[print('Hello, BeeGeek!') for i in range(0, 19)]
